# UDP Configuration & Real-time Feedback - v3 & Simulator

## ‚ú® New Features (December 2025)

### 1. UDP Configuration Commands

Change UDP address and ports dynamically without editing code.

### 2. Real-time Status Feedback

Both terminals show live feedback when states change.

### 3. Wallbox Disable Protection

All charging and control commands blocked when wallbox is disabled with clear feedback.

**How it works:**

- Wallbox continuously sends its enable/disable status via UDP (every 500ms)
- Simulator reads this status from incoming UDP packets
- All simulator commands are blocked when wallbox reports `enable=false`

**Blocked commands when disabled:**

- Wallbox: `start`, `pause`, `resume`
- Simulator: `on`, `off`, `no_can`, `idle`, `ready`, `charge`, `stop`

### 4. State Change Notifications

Automatic notifications when charging states transition (idle ‚Üí ready ‚Üí charging).

### 5. No Vehicle Simulation

New `no_can` command to simulate disconnected vehicle state.

---

## New Commands Added

### Wallbox Controller v3

#### View UDP Configuration

```bash
> getudp
```

Shows current UDP settings:

- Listen Port
- Send Port
- Send Address

#### Change UDP Configuration

```bash
> setudp <address> <listen_port> <send_port>
```

**Example:**

```bash
> setudp 192.168.1.100 50020 50021
```

**Note:** Changes require restart to take effect.

---

### Simulator

#### View UDP Configuration

```bash
> getudp
```

Shows:

- Target Address
- Listen Port (in)
- Send Port (out)

#### Change UDP Configuration

```bash
> setudp <address> <in_port> <out_port>
```

**Example:**

```bash
> setudp 192.168.1.50 50021 50020
```

**Note:** Port changes require simulator restart to rebind sockets.

---

## Complete Command Reference

### Wallbox Controller v3

| Command                             | Description                |
| ----------------------------------- | -------------------------- |
| `enable`                            | Enable wallbox             |
| `disable`                           | Disable wallbox            |
| `start`                             | Start charging             |
| `stop`                              | Stop charging              |
| `pause`                             | Pause charging             |
| `resume`                            | Resume charging            |
| `status`                            | Show current status        |
| `setrelay <pin>`                    | Change relay pin (0-27)    |
| `getpins`                           | Show pin configuration     |
| **`getudp`**                        | **Show UDP configuration** |
| **`setudp <addr> <listen> <send>`** | **Set UDP config**         |
| `help`                              | Show help                  |
| `quit`                              | Exit                       |

### Simulator

| Command                        | Description                                      |
| ------------------------------ | ------------------------------------------------ |
| `on`                           | Turn main contactor ON                           |
| `off`                          | Turn main contactor OFF                          |
| **`no_can`**                   | **Simulate no vehicle connected (disconnect)**   |
| `idle`                         | Set state to IDLE (vehicle plugged, no charging) |
| `ready`                        | Set state to READY (ready to charge)             |
| `charge`                       | Set state to CHARGING (power transfer active)    |
| `stop`                         | Set state to STOP (stopping session)             |
| `status`                       | Show current status with descriptions            |
| **`getudp`**                   | **Show UDP configuration**                       |
| **`setudp <addr> <in> <out>`** | **Set UDP config**                               |
| `help`                         | Show help                                        |
| `quit`                         | Exit                                             |
| **`setudp <addr> <in> <out>`** | **Set UDP config**                               |
| `help`                         | Show help                                        |
| `quit`                         | Exit                                             |

---

## Usage Examples

### Simulate Vehicle Connection Sequence

```bash
# In simulator
> no_can
‚úì Simulating: NO VEHICLE CONNECTED

> on
‚úì Main contactor turned ON
[SIMULATOR ‚Üí WALLBOX] Sending contactor ON command

> idle
‚úì Charging state changed to: IDLE (Vehicle plugged, no charging)
[SIMULATOR ‚Üí WALLBOX] Sending state: IDLE

> ready
‚úì Charging state changed to: READY (Vehicle ready to charge)
[SIMULATOR] üìä State transition: idle ‚Üí ready

> charge
‚úì Charging state changed to: CHARGING (Power transfer active)
[SIMULATOR] üìä State transition: ready ‚Üí charging
```

### Test Wallbox Disable Protection

```bash
# In wallbox
> disable
[WALLBOX] üî¥ Wallbox DISABLED - All charging commands blocked

> start
‚ö†Ô∏è  Cannot start charging: wallbox is disabled
[WALLBOX] ‚ùå Command rejected - wallbox disabled

> enable
[WALLBOX] üü¢ Wallbox ENABLED - Ready for charging

> start
[WALLBOX ‚Üí SIMULATOR] ‚úì Starting charging sequence
```

### Change Wallbox to custom IP

```bash
# In wallbox_control_v3
> getudp
UDP Configuration:
  Listen Port: 50010
  Send Port: 50011
  Send Address: 127.0.0.1

> setudp 192.168.1.100 50010 50011
‚úì UDP config will be: 192.168.1.100:50010 -> 50011
  (Restart required to apply changes)

> quit
```

### Change Simulator ports

```bash
# In simulator
> getudp
UDP Configuration:
  Target Address: 127.0.0.1
  Listen Port (in): 50011
  Send Port (out): 50010

> setudp 192.168.1.100 50021 50020
‚úì UDP configuration updated to: 192.168.1.100 50021 -> 50020
  (Restart simulator to rebind ports)

> quit
```

---

## Port Configuration Rules

1. **Port numbers**: 1-65535
2. **Listen Port**: Where the application receives UDP messages
3. **Send Port**: Where the application sends UDP messages
4. **Wallbox vs Simulator**: Ports must be swapped
   - Wallbox listen = Simulator send
   - Wallbox send = Simulator listen

### Default Configuration

```
Wallbox:   Listen: 50010, Send: 50011, Target: 127.0.0.1
Simulator: Listen: 50011, Send: 50010, Target: 127.0.0.1
```

### Custom Network Example

```
Wallbox (192.168.1.100):
  setudp 192.168.1.50 50010 50011

Simulator (192.168.1.50):
  setudp 192.168.1.100 50011 50010
```

---

## Real-time Feedback Examples

### Wallbox Status Changes

```
[WALLBOX] üü¢ Wallbox ENABLED - Ready for charging
[WALLBOX] üî¥ Wallbox DISABLED - All charging commands blocked
```

### When Wallbox is Disabled

```
# In wallbox terminal:
> start
‚ö†Ô∏è  Cannot start charging: wallbox is disabled
[WALLBOX] ‚ùå Command rejected - wallbox disabled

# In simulator terminal:
[WALLBOX ‚Üí SIMULATOR] üî¥ WALLBOX DISABLED - Charging blocked

# Try any simulator command - all are blocked:
> on
‚ö†Ô∏è  Cannot turn contactor ON: wallbox is disabled
[SIMULATOR] ‚ùå Command rejected - wallbox disabled

> ready
‚ö†Ô∏è  Cannot change to READY state: wallbox is disabled
[SIMULATOR] ‚ùå Command rejected - wallbox disabled

> no_can
‚ö†Ô∏è  Cannot simulate vehicle disconnect: wallbox is disabled
[SIMULATOR] ‚ùå Command rejected - wallbox disabled
```

### Relay State Changes

```
# In wallbox terminal:
[WALLBOX ‚Üí SIMULATOR] Relay state: ON

# In simulator terminal:
[WALLBOX ‚Üí SIMULATOR] üîå Relay state changed: OFF ‚Üí ‚úÖ ON
```

### State Transitions (Simulator)

```
[SIMULATOR] üìä State transition: idle ‚Üí ready
[SIMULATOR] üìä State transition: ready ‚Üí charging
[SIMULATOR] üìä State transition: charging ‚Üí stop
```

### No Vehicle Connected

```
> no_can
‚úì Simulating: NO VEHICLE CONNECTED
[SIMULATOR ‚Üí WALLBOX] Vehicle disconnected - State: IDLE, Contactor: OFF

> status
--- Current Status ---
Main Contactor: OFF
Charging State: idle (No vehicle connected)
UDP Address: 127.0.0.1
UDP In Port: 50011
UDP Out Port: 50010
```

---

## Usage Examples

### Simulate Vehicle Connection Sequence

```bash
# In simulator
> no_can
‚úì Simulating: NO VEHICLE CONNECTED

> on
‚úì Main contactor turned ON
[SIMULATOR ‚Üí WALLBOX] Sending contactor ON command

> idle
‚úì Charging state changed to: IDLE (Vehicle plugged, no charging)
[SIMULATOR ‚Üí WALLBOX] Sending state: IDLE

> ready
‚úì Charging state changed to: READY (Vehicle ready to charge)
[SIMULATOR] üìä State transition: idle ‚Üí ready

> charge
‚úì Charging state changed to: CHARGING (Power transfer active)
[SIMULATOR] üìä State transition: ready ‚Üí charging
```

### Test Wallbox Disable Protection

```bash
# In wallbox
> disable
[WALLBOX] üî¥ Wallbox DISABLED - All charging commands blocked

> start
‚ö†Ô∏è  Cannot start charging: wallbox is disabled
[WALLBOX] ‚ùå Command rejected - wallbox disabled

> enable
[WALLBOX] üü¢ Wallbox ENABLED - Ready for charging

> start
[WALLBOX ‚Üí SIMULATOR] ‚úì Starting charging sequence
```

### Change UDP Configuration

```bash
# Change Wallbox to custom IP
> getudp
UDP Configuration:
  Listen Port: 50010
  Send Port: 50011
  Send Address: 127.0.0.1

> setudp 192.168.1.100 50010 50011
‚úì UDP config will be: 192.168.1.100:50010 -> 50011
  (Restart required to apply changes)
```

---

## Summary of All Changes

### Wallbox Controller v3

‚úÖ UDP configuration commands (`getudp`, `setudp`)
‚úÖ Real-time relay state feedback
‚úÖ Wallbox enable/disable status messages
‚úÖ Command blocking when disabled (start, pause, resume)
‚úÖ Clear warning messages with emojis

### Simulator

‚úÖ UDP configuration commands (`getudp`, `setudp`)
‚úÖ Automatic state transition notifications
‚úÖ No vehicle simulation (`no_can` command)
‚úÖ Enhanced status display with descriptions
‚úÖ Relay change notifications
‚úÖ Wallbox enable/disable feedback
‚úÖ Command blocking when disabled (on, off, no_can, idle, ready, charge, stop)
‚úÖ Clear state descriptions in status

### Communication Feedback

‚úÖ Bidirectional status updates
‚úÖ Real-time notifications on both terminals
‚úÖ Clear visual indicators (üü¢üî¥‚ö†Ô∏è‚úÖ‚ùåüîåüìä)
‚úÖ Descriptive state messages

```
Wallbox                    Simulator
--------                   ---------
enable/disable command
‚Üì
m_wallboxEnabled = true/false
‚Üì
sendStatusToSimulator()    ‚Üê UDP (every 500ms)
(enable field in packet)   ‚Üì
                           g_lastEnableState updated
                           ‚Üì
                           ensure_wallbox_enabled() checks
                           ‚Üì
                           Commands allowed/blocked
```
